SpenceKonde/megaTinyCore/megaavr/boards.txt
##############################################################
#      Tools Submenu Names
##############################################################

menu.chip=Chip
menu.clock=Clock
menu.clockopti=Clock (burn bootloader req'd, or see docs)
menu.millis=millis()/micros()
menu.uartvoltage=Voltage for UART baud (ignored for 2k/4k parts)
menu.serialevent=Support SerialEvent
menu.startuptime=Startup Time
menu.startuptimeopti=Startup Time (burn bootloader req'd)
menu.bodvoltage=BOD level if enabled (burn bootloader req'd)
menu.bodmode=BOD Mode when active/sleeping (burn bootloader req'd)
menu.eesave=Save EEPROM (burn bootloader req'd)
menu.bootloaderuart=UART for Bootloader (burn bootloader req'd)
menu.resetpin=UPDI Pin, READ DOCS or pick UPDI! (burn bootloader req'd)
menu.resetpinopti=UPDI/reset pin (burn bootloader req'd)

# The *opti menus are for Optiboot board definitions;
# they function identically, just differ in the
# information shown in the submenu name.

##############################################################
#      Board Names
##############################################################

atxy7.name=ATtiny3217/1617/1607/817/807/417
atxy6.name=ATtiny3216/1616/1606/816/806/416/406
atxy4.name=ATtiny1614/1604/814/804/414/404/214/204
atxy2.name=ATtiny412/402/212/202
Xplained416.name=Attiny416 Xplained Nano (Optiboot)
Xplained817.name=Attiny817 Xplained Mini (Optiboot)
atxy7o.name=ATtiny3217/1617/1607/817/807/417 (Optiboot)
atxy6o.name=ATtiny3216/1616/1606/816/806/416/406 (Optiboot)
atxy4o.name=ATtiny1614/1604/814/804/414/404/214/204 (Optiboot)
atxy2o.name=ATtiny412/402/212/202 (Optiboot)

##############################################################
#      ATtiny3217/1617/1607/817/807/417
##############################################################

atxy7.upload.workaround=
atxy7.build.millistimer=D0
atxy7.build.bootload=
atxy7.build.board=AVR_ATtinyxy7
atxy7.build.mcu=attiny{build.attiny}
atxy7.build.serialeventabr=
atxy7.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy7.build.f_cpu={build.speed}000000L

atxy7.menu.chip.3217=ATtiny3217
atxy7.menu.chip.3217.build.board=AVR_ATtiny3217
atxy7.menu.chip.3217.build.attiny=3217
atxy7.menu.chip.3217.upload.maximum_size=32768
atxy7.menu.chip.3217.upload.maximum_data_size=2048
atxy7.menu.chip.1617=ATtiny1617
atxy7.menu.chip.1617.build.board=AVR_ATtiny1617
atxy7.menu.chip.1617.build.attiny=1617
atxy7.menu.chip.1617.upload.maximum_size=16384
atxy7.menu.chip.1617.upload.maximum_data_size=2048
atxy7.menu.chip.817=ATtiny817
atxy7.menu.chip.817.build.board=AVR_ATtiny817
atxy7.menu.chip.817.build.attiny=817
atxy7.menu.chip.817.upload.maximum_size=8192
atxy7.menu.chip.817.upload.maximum_data_size=512
atxy7.menu.chip.417=ATtiny417
atxy7.menu.chip.417.build.board=AVR_ATtiny417
atxy7.menu.chip.417.build.attiny=417
atxy7.menu.chip.417.upload.maximum_size=4096
atxy7.menu.chip.417.upload.maximum_data_size=256
atxy7.menu.chip.1607=ATtiny1607
atxy7.menu.chip.1607.build.board=AVR_ATtiny1607
atxy7.menu.chip.1607.build.attiny=1607
atxy7.menu.chip.1607.build.millistimer=A0
atxy7.menu.chip.1607.upload.maximum_size=16384
atxy7.menu.chip.1607.upload.maximum_data_size=1024
atxy7.menu.chip.807=ATtiny807
atxy7.menu.chip.807.build.board=AVR_ATtiny807
atxy7.menu.chip.807.build.attiny=807
atxy7.menu.chip.807.build.millistimer=A0
atxy7.menu.chip.807.upload.maximum_size=8192
atxy7.menu.chip.807.upload.maximum_data_size=512

atxy7.menu.clock.20internal=20 MHz Internal
atxy7.menu.clock.16internal=16 MHz Internal
atxy7.menu.clock.10internal=10 MHz Internal
atxy7.menu.clock.8internal=8 MHz Internal
atxy7.menu.clock.5internal=5 MHz Internal
atxy7.menu.clock.4internal=4 MHz Internal
atxy7.menu.clock.1internal=1 MHz Internal
atxy7.menu.clock.20extclock=20 MHz External CLOCK
atxy7.menu.clock.16extclock=16 MHz External CLOCK
atxy7.menu.clock.12extclock=12 MHz External CLOCK
atxy7.menu.clock.10extclock=10 MHz External CLOCK
atxy7.menu.clock.8extclock=8 MHz External CLOCK
atxy7.menu.clock.24extclock=24 MHz External CLOCK (overclocked)
atxy7.menu.clock.28extclock=28 MHz External CLOCK (overclocked)
atxy7.menu.clock.32extclock=32 MHz External CLOCK (overclocked)
atxy7.menu.clock.20internal.build.speed=20
atxy7.menu.clock.20internal.build.clocksource=0
atxy7.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.16internal.build.speed=16
atxy7.menu.clock.16internal.build.clocksource=0
atxy7.menu.clock.10internal.build.speed=10
atxy7.menu.clock.10internal.build.clocksource=0
atxy7.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.8internal.build.speed=8
atxy7.menu.clock.8internal.build.clocksource=0
atxy7.menu.clock.5internal.build.speed=5
atxy7.menu.clock.5internal.build.clocksource=0
atxy7.menu.clock.5internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.4internal.build.speed=4
atxy7.menu.clock.4internal.build.clocksource=0
atxy7.menu.clock.1internal.build.speed=1
atxy7.menu.clock.1internal.build.clocksource=0
atxy7.menu.clock.20extclock.build.speed=20
atxy7.menu.clock.20extclock.build.clocksource=2
atxy7.menu.clock.16extclock.build.speed=16
atxy7.menu.clock.16extclock.build.clocksource=2
atxy7.menu.clock.12extclock.build.speed=12
atxy7.menu.clock.12extclock.build.clocksource=2
atxy7.menu.clock.10extclock.build.speed=10
atxy7.menu.clock.10extclock.build.clocksource=2
atxy7.menu.clock.8extclock.build.speed=8
atxy7.menu.clock.8extclock.build.clocksource=2
atxy7.menu.clock.24extclock.build.speed=24
atxy7.menu.clock.24extclock.build.clocksource=2
atxy7.menu.clock.28extclock.build.speed=28
atxy7.menu.clock.28extclock.build.clocksource=2
atxy7.menu.clock.32extclock.build.speed=32
atxy7.menu.clock.32extclock.build.clocksource=2

atxy7.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7.menu.bodvoltage.2v1=2.1V (unofficial)
atxy7.menu.bodvoltage.2v9=2.9V (unofficial)
atxy7.menu.bodvoltage.3v3=3.3V (unofficial)
atxy7.menu.bodvoltage.3v7=3.7V (unofficial)
atxy7.menu.bodvoltage.4v0=4.0V (unofficial)
atxy7.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy7.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7.menu.bodvoltage.2v1.bootloader.bodlevbits=001

atxy7.menu.bodmode.disabled=Disabled/Disabled
atxy7.menu.bodmode.enabled=Enabled/Enabled
atxy7.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
atxy7.menu.bodmode.ensampslow=Enabled/Sampled (125Hz)
atxy7.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
atxy7.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
atxy7.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
atxy7.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
atxy7.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy7.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy7.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy7.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy7.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy7.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy7.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy7.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy7.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy7.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy7.menu.eesave.enable=EEPROM retained
atxy7.menu.eesave.enable.bootloader.eesavebit=1
atxy7.menu.eesave.disable=EEPROM not retained
atxy7.menu.eesave.disable.bootloader.eesavebit=0

atxy7.menu.millis.enabled=Enabled (default timer)
atxy7.menu.millis.disabled=Disabled (saves flash)
atxy7.menu.millis.timera=TCA0 (default on 0-series)
atxy7.menu.millis.timerd=TCD0 (1-series only, default there)
atxy7.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy7.menu.millis.timerb1=TCB1 (3217,1617 only)
atxy7.menu.millis.rtc=RTC (no micros)
atxy7.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy7.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
atxy7.menu.millis.disabled.build.millistimer=NONE
atxy7.menu.millis.timera.build.millistimer=A0
atxy7.menu.millis.timerd.build.millistimer=D0
atxy7.menu.millis.timerb0.build.millistimer=B0
atxy7.menu.millis.timerb1.build.millistimer=B1
atxy7.menu.millis.rtc.build.millistimer=RTC
atxy7.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy7.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

atxy7.menu.resetpin.UPDI=UPDI (pick this unless you have an HV UPDI programmer!)
atxy7.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy7.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
atxy7.menu.resetpin.reset.bootloader.resetpinbits=10
atxy7.menu.resetpin.gpio=IO (DANGER - Bricks chip w/out HV UPDI programmer! Use PCHV)
atxy7.menu.resetpin.gpio.bootloader.resetpinbits=00

atxy7.menu.startuptime.8=8ms
atxy7.menu.startuptime.0=0ms
atxy7.menu.startuptime.1=1ms
atxy7.menu.startuptime.2=2ms
atxy7.menu.startuptime.4=4ms
atxy7.menu.startuptime.16=16ms
atxy7.menu.startuptime.32=32ms
atxy7.menu.startuptime.64=64ms
atxy7.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy7.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy7.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy7.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy7.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy7.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy7.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy7.menu.startuptime.64.bootloader.SYSCFG1=0x07

