SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy7.menu.uartvoltage.5v=Closer to 5v
atxy7.menu.uartvoltage.3v=Closer to 3v
atxy7.menu.uartvoltage.5v.build.uartvoltage=5V
atxy7.menu.uartvoltage.3v.build.uartvoltage=3V

atxy7.menu.serialevent.no=No (saves space)
atxy7.menu.serialevent.yes=Yes
atxy7.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
atxy7.menu.serialevent.yes.build.serialevent=
atxy7.menu.serialevent.yes.build.serialeventabr=E
atxy7.upload.tool=avrdude

atxy7.build.core=megatinycore
atxy7.build.variant=txy7
atxy7.build.text_section_start=.text=0x0
atxy7.build.extra_flags=-DARDUINO_attinyxy7 {build.serialevent} {build.millis} -DUARTBAUD{build.uartvoltage}
atxy7.build.export_merged_output=false

atxy7.bootloader.tool=avrdude
atxy7.bootloader.WDTCFG=0x00
atxy7.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy7.bootloader.OSCCFG=0x01
atxy7.bootloader.TCD0CFG=0x00
atxy7.bootloader.APPEND=0x00
atxy7.bootloader.BOOTEND=0x00
atxy7.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy7.bootloader.flashcommand=

##############################################################
#      ATtiny3216/1616/1606/816/806/416/406
##############################################################

atxy6.upload.workaround=
atxy6.build.millistimer=D0
atxy6.build.bootload=
atxy6.build.board=AVR_ATtinyxy6
atxy6.build.core=megatinycore
atxy6.build.mcu=attiny{build.attiny}
atxy6.build.serialeventabr=
atxy6.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy6.build.f_cpu={build.speed}000000L
atxy6.build.extra_flags=-DARDUINO_attinyxy6 {build.serialevent} {build.millis} -DUARTBAUD{build.uartvoltage}
atxy6.build.export_merged_output=false
atxy6.build.variant=txy6
atxy6.build.text_section_start=.text=0x0


atxy6.menu.serialevent.no=No (saves space)
atxy6.menu.serialevent.yes=Yes
atxy6.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
atxy6.menu.serialevent.yes.build.serialevent=
atxy6.menu.serialevent.yes.build.serialeventabr=E
atxy6.upload.tool=avrdude

atxy6.bootloader.tool=avrdude
atxy6.bootloader.WDTCFG=0x00
atxy6.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy6.bootloader.OSCCFG=0x01
atxy6.bootloader.TCD0CFG=0x00
atxy6.bootloader.APPEND=0x00
atxy6.bootloader.BOOTEND=0x00
atxy6.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy6.bootloader.flashcommand=

atxy6.menu.chip.3216=ATtiny3216
atxy6.menu.chip.3216.build.board=AVR_ATtiny3216
atxy6.menu.chip.3216.build.attiny=3216
atxy6.menu.chip.3216.upload.maximum_size=32768
atxy6.menu.chip.3216.upload.maximum_data_size=2048
atxy6.menu.chip.1616=ATtiny1616
atxy6.menu.chip.1616.build.board=AVR_ATtiny1616
atxy6.menu.chip.1616.build.attiny=1616
atxy6.menu.chip.1616.upload.maximum_size=16384
atxy6.menu.chip.1616.upload.maximum_data_size=2048
atxy6.menu.chip.816=ATtiny816
atxy6.menu.chip.816.build.board=AVR_ATtiny816
atxy6.menu.chip.816.build.attiny=816
atxy6.menu.chip.816.upload.maximum_size=8192
atxy6.menu.chip.816.upload.maximum_data_size=512
atxy6.menu.chip.416=ATtiny416
atxy6.menu.chip.416.build.board=AVR_ATtiny416
atxy6.menu.chip.416.build.attiny=416
atxy6.menu.chip.416.upload.maximum_size=4096
atxy6.menu.chip.416.upload.maximum_data_size=256
atxy6.menu.chip.1606=ATtiny1606
atxy6.menu.chip.1606.build.board=AVR_ATtiny1606
atxy6.menu.chip.1606.build.attiny=1606
atxy6.menu.chip.1606.build.millistimer=A0
atxy6.menu.chip.1606.upload.maximum_size=16384
atxy6.menu.chip.1606.upload.maximum_data_size=1024
atxy6.menu.chip.806=ATtiny806
atxy6.menu.chip.806.build.board=AVR_ATtiny806
atxy6.menu.chip.806.build.attiny=806
atxy6.menu.chip.806.build.millistimer=A0
atxy6.menu.chip.806.upload.maximum_size=8192
atxy6.menu.chip.806.upload.maximum_data_size=512
atxy6.menu.chip.406=ATtiny406
atxy6.menu.chip.406.build.board=AVR_ATtiny406
atxy6.menu.chip.406.build.attiny=406
atxy6.menu.chip.406.build.millistimer=A0
atxy6.menu.chip.406.upload.maximum_size=4096
atxy6.menu.chip.406.upload.maximum_data_size=256

atxy6.menu.clock.20internal=20 MHz Internal
atxy6.menu.clock.16internal=16 MHz Internal
atxy6.menu.clock.10internal=10 MHz Internal
atxy6.menu.clock.8internal=8 MHz Internal
atxy6.menu.clock.5internal=5 MHz Internal
atxy6.menu.clock.4internal=4 MHz Internal
atxy6.menu.clock.1internal=1 MHz Internal
atxy6.menu.clock.20extclock=20 MHz External CLOCK
atxy6.menu.clock.16extclock=16 MHz External CLOCK
atxy6.menu.clock.12extclock=12 MHz External CLOCK
atxy6.menu.clock.10extclock=10 MHz External CLOCK
atxy6.menu.clock.8extclock=8 MHz External CLOCK
atxy6.menu.clock.24extclock=24 MHz External CLOCK (overclocked)
atxy6.menu.clock.28extclock=28 MHz External CLOCK (overclocked)
atxy6.menu.clock.32extclock=32 MHz External CLOCK (overclocked)
atxy6.menu.clock.20internal.build.speed=20
atxy6.menu.clock.20internal.build.clocksource=0
atxy6.menu.clock.16internal.build.speed=16
atxy6.menu.clock.16internal.build.clocksource=0
atxy6.menu.clock.10internal.build.speed=10
atxy6.menu.clock.10internal.build.clocksource=0
atxy6.menu.clock.8internal.build.speed=8
atxy6.menu.clock.8internal.build.clocksource=0
atxy6.menu.clock.5internal.build.speed=5
atxy6.menu.clock.5internal.build.clocksource=0
atxy6.menu.clock.4internal.build.speed=4
atxy6.menu.clock.4internal.build.clocksource=0
atxy6.menu.clock.1internal.build.speed=1
atxy6.menu.clock.1internal.build.clocksource=0
atxy6.menu.clock.20extclock.build.speed=20
atxy6.menu.clock.20extclock.build.clocksource=2
atxy6.menu.clock.16extclock.build.speed=16
atxy6.menu.clock.16extclock.build.clocksource=2
atxy6.menu.clock.12extclock.build.speed=12
atxy6.menu.clock.12extclock.build.clocksource=2
atxy6.menu.clock.10extclock.build.speed=10
atxy6.menu.clock.10extclock.build.clocksource=2
atxy6.menu.clock.8extclock.build.speed=8
atxy6.menu.clock.8extclock.build.clocksource=2
atxy6.menu.clock.24extclock.build.speed=24
atxy6.menu.clock.24extclock.build.clocksource=2
atxy6.menu.clock.28extclock.build.speed=28
atxy6.menu.clock.28extclock.build.clocksource=2
atxy6.menu.clock.32extclock.build.speed=32
atxy6.menu.clock.32extclock.build.clocksource=2
atxy6.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy6.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy6.menu.clock.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy6.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy6.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy6.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy6.menu.bodvoltage.2v1=2.1V (unofficial)
atxy6.menu.bodvoltage.2v9=2.9V (unofficial)
atxy6.menu.bodvoltage.3v3=3.3V (unofficial)
atxy6.menu.bodvoltage.3v7=3.7V (unofficial)
atxy6.menu.bodvoltage.4v0=4.0V (unofficial)
atxy6.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy6.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy6.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy6.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy6.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy6.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy6.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy6.menu.bodvoltage.2v1.bootloader.bodlevbits=001

