SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy4o.menu.serialevent.no=No (saves space)
atxy4o.menu.serialevent.yes=Yes
atxy4o.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
atxy4o.menu.serialevent.yes.build.serialevent=
atxy4o.menu.serialevent.yes.build.serialeventabr=E
atxy4o.upload.tool=avrdude

atxy4o.build.core=megatinycore
atxy4o.build.variant=txy4
atxy4o.build.extra_flags=-DARDUINO_attinyxy4 {build.serialevent} {build.millis} -DUARTBAUD{build.uartvoltage}
atxy4o.build.export_merged_output=true

atxy4o.upload.protocol=arduino
atxy4o.upload.extra_params=-D
atxy4o.build.text_section_start=.text=0x200
atxy4o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy4o.bootloader.tool=avrdude

atxy4o.menu.bootloaderuart.default=TX:5 (PB2), RX:4 (PB3)
atxy4o.menu.bootloaderuart.alternate=TX:8 (PA1), RX:9 (PA2)
atxy4o.menu.bootloaderuart.default.bootloader.uartswap=
atxy4o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

atxy4o.menu.resetpinopti.UPDI=UPDI (powercycle to enter bootloader)
atxy4o.menu.resetpinopti.UPDI.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}.hex
atxy4o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy4o.menu.resetpinopti.UPDIErsatzReset=UPDI, bootloader uses ersatz reset pin
atxy4o.menu.resetpinopti.UPDIErsatzReset.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}_1sec.hex
atxy4o.menu.resetpinopti.UPDIErsatzReset.bootloader.resetpinbits=01
atxy4o.menu.resetpinopti.reset=Reset (DANGER - Read docs first!)
atxy4o.menu.resetpinopti.reset.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}_rst.hex
atxy4o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy4o.menu.resetpinopti.gpio=IO (DANGER - Read docs first! powercycle to enter bootloader)
atxy4o.menu.resetpinopti.gpio.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}.hex
atxy4o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

atxy4o.menu.startuptimeopti.8=8ms
atxy4o.menu.startuptimeopti.0=0ms
atxy4o.menu.startuptimeopti.1=1ms
atxy4o.menu.startuptimeopti.2=2ms
atxy4o.menu.startuptimeopti.4=4ms
atxy4o.menu.startuptimeopti.16=16ms
atxy4o.menu.startuptimeopti.32=32ms
atxy4o.menu.startuptimeopti.64=64ms
atxy4o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy4o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy4o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy4o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy4o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy4o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy4o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy4o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

atxy4o.bootloader.WDTCFG=0x00
atxy4o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy4o.bootloader.OSCCFG=0x01
atxy4o.bootloader.TCD0CFG=0x00
atxy4o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy4o.bootloader.APPEND=0x00
atxy4o.bootloader.BOOTEND=0x02

##############################################################
#      ATtiny412/402/212/202 (Optiboot)
##############################################################

atxy2o.upload.workaround=
atxy2o.build.millistimer=D0
atxy2o.build.bootload=opti
atxy2o.build.board=AVR_ATtinyxy2
atxy2o.build.mcu=attiny{build.attiny}
atxy2o.build.serialeventabr=
atxy2o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy2o.build.f_cpu={build.speed}000000L
atxy2o.upload.speed=115200

atxy2o.menu.chip.412=ATtiny412
atxy2o.menu.chip.412.build.board=AVR_ATtiny412
atxy2o.menu.chip.412.build.attiny=412
atxy2o.menu.chip.412.upload.maximum_size=3584
atxy2o.menu.chip.412.upload.maximum_data_size=256
atxy2o.menu.chip.212=ATtiny212
atxy2o.menu.chip.212.build.board=AVR_ATtiny212
atxy2o.menu.chip.212.build.attiny=212
atxy2o.menu.chip.212.upload.maximum_size=1536
atxy2o.menu.chip.212.upload.maximum_data_size=128
atxy2o.menu.chip.402=ATtiny402
atxy2o.menu.chip.402.build.board=AVR_ATtiny402
atxy2o.menu.chip.402.build.attiny=402
atxy2o.menu.chip.402.build.millistimer=A0
atxy2o.menu.chip.402.upload.maximum_size=3584
atxy2o.menu.chip.402.upload.maximum_data_size=256
atxy2o.menu.chip.402w=ATtiny402 (bad signature)
atxy2o.menu.chip.402w.build.attiny=402
atxy2o.menu.chip.402w.build.board=AVR_ATtiny402
atxy2o.menu.chip.402w.build.millistimer=A0
atxy2o.menu.chip.402w.upload.maximum_size=3584
atxy2o.menu.chip.402w.upload.maximum_data_size=256
atxy2o.menu.chip.402w.upload.workaround=w
atxy2o.menu.chip.202=ATtiny202
atxy2o.menu.chip.202.build.board=AVR_ATtiny202
atxy2o.menu.chip.202.build.attiny=202
atxy2o.menu.chip.202.build.millistimer=A0
atxy2o.menu.chip.202.upload.maximum_size=1536
atxy2o.menu.chip.202.upload.maximum_data_size=128

atxy2o.menu.clockopti.20internal=20 MHz Internal
atxy2o.menu.clockopti.16internal=16 MHz Internal
atxy2o.menu.clockopti.10internal=10 MHz Internal
atxy2o.menu.clockopti.8internal=8 MHz Internal
atxy2o.menu.clockopti.5internal=5 MHz Internal
atxy2o.menu.clockopti.4internal=4 MHz Internal
atxy2o.menu.clockopti.1internal=1 MHz Internal
atxy2o.menu.clockopti.20extclock=20 MHz External CLOCK
atxy2o.menu.clockopti.16extclock=16 MHz External CLOCK
atxy2o.menu.clockopti.12extclock=12 MHz External CLOCK
atxy2o.menu.clockopti.10extclock=10 MHz External CLOCK
atxy2o.menu.clockopti.8extclock=8 MHz External CLOCK
atxy2o.menu.clockopti.24extclock=24 MHz External CLOCK (overclocked)
atxy2o.menu.clockopti.28extclock=28 MHz External CLOCK (overclocked)
atxy2o.menu.clockopti.32extclock=32 MHz External CLOCK (overclocked)
atxy2o.menu.clockopti.20internal.build.speed=20
atxy2o.menu.clockopti.20internal.build.clocksource=0
atxy2o.menu.clockopti.16internal.build.speed=16
atxy2o.menu.clockopti.16internal.build.clocksource=0
atxy2o.menu.clockopti.10internal.build.speed=10
atxy2o.menu.clockopti.10internal.build.clocksource=0
atxy2o.menu.clockopti.8internal.build.speed=8
atxy2o.menu.clockopti.8internal.build.clocksource=0
atxy2o.menu.clockopti.5internal.build.speed=5
atxy2o.menu.clockopti.5internal.build.clocksource=0
atxy2o.menu.clockopti.4internal.build.speed=4
atxy2o.menu.clockopti.4internal.build.clocksource=0
atxy2o.menu.clockopti.1internal.build.speed=1
atxy2o.menu.clockopti.1internal.build.clocksource=0
atxy2o.menu.clockopti.20extclock.build.speed=20
atxy2o.menu.clockopti.20extclock.build.clocksource=2
atxy2o.menu.clockopti.16extclock.build.speed=16
atxy2o.menu.clockopti.16extclock.build.clocksource=2
atxy2o.menu.clockopti.12extclock.build.speed=12
atxy2o.menu.clockopti.12extclock.build.clocksource=2
atxy2o.menu.clockopti.10extclock.build.speed=10
atxy2o.menu.clockopti.10extclock.build.clocksource=2
atxy2o.menu.clockopti.8extclock.build.speed=8
atxy2o.menu.clockopti.8extclock.build.clocksource=2
atxy2o.menu.clockopti.24extclock.build.speed=24
atxy2o.menu.clockopti.24extclock.build.clocksource=2
atxy2o.menu.clockopti.28extclock.build.speed=28
atxy2o.menu.clockopti.28extclock.build.clocksource=2
atxy2o.menu.clockopti.32extclock.build.speed=32
atxy2o.menu.clockopti.32extclock.build.clocksource=2
atxy2o.menu.clockopti.20internal.bootloader.OSCCFG=0x02
atxy2o.menu.clockopti.10internal.bootloader.OSCCFG=0x02
atxy2o.menu.clockopti.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy2o.menu.millis.enabled=Enabled (default timer)
atxy2o.menu.millis.disabled=Disabled (saves flash)
atxy2o.menu.millis.timera=TCA0 (default on 402/202)
atxy2o.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2o.menu.millis.rtc=RTC (no micros)
atxy2o.menu.millis.disabled.build.millistimer=NONE
atxy2o.menu.millis.timera.build.millistimer=A0
atxy2o.menu.millis.timerd.build.millistimer=D0
atxy2o.menu.millis.timerb0.build.millistimer=B0
atxy2o.menu.millis.rtc.build.millistimer=RTC

atxy2o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy2o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy2o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy2o.menu.bodvoltage.2v1=2.1V (unofficial)
atxy2o.menu.bodvoltage.2v9=2.9V (unofficial)
atxy2o.menu.bodvoltage.3v3=3.3V (unofficial)
atxy2o.menu.bodvoltage.3v7=3.7V (unofficial)
atxy2o.menu.bodvoltage.4v0=4.0V (unofficial)
atxy2o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy2o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy2o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

atxy2o.menu.bodmode.disabled=Disabled/Disabled
atxy2o.menu.bodmode.enabled=Enabled/Enabled
atxy2o.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
atxy2o.menu.bodmode.ensampslow=Enabled/Sampled (125Hz)
atxy2o.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
atxy2o.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
atxy2o.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
atxy2o.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
atxy2o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy2o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy2o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy2o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy2o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy2o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy2o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy2o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy2o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy2o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy2o.menu.bootloaderuart.default=TX:0 (PA6), RX:1 (PA7)
atxy2o.menu.bootloaderuart.alternate=TX:2 (PA1), RX:3 (PA2)
atxy2o.menu.bootloaderuart.default.bootloader.uartswap=
atxy2o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

atxy2o.menu.serialevent.no=No (saves space)
atxy2o.menu.serialevent.yes=Yes
atxy2o.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
atxy2o.menu.serialevent.yes.build.serialevent=
atxy2o.menu.serialevent.yes.build.serialeventabr=E

atxy2o.upload.tool=avrdude

atxy2o.upload.protocol=arduino
atxy2o.upload.extra_params=-D
atxy2o.build.text_section_start=.text=0x200
atxy2o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy2o.bootloader.tool=avrdude

atxy2o.build.core=megatinycore
atxy2o.build.variant=txy2
atxy2o.build.uartvoltage=NA
atxy2o.build.extra_flags=-DARDUINO_attinyxy2 {build.serialevent} {build.millis} -DUARTBAUD{build.uartvoltage}
atxy2o.build.export_merged_output=true

atxy2o.menu.resetpinopti.UPDI=UPDI (powercycle to enter bootloader)
atxy2o.menu.resetpinopti.UPDI.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy2o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy2o.menu.resetpinopti.UPDIErsatzReset=UPDI, bootloader uses ersatz reset pin
atxy2o.menu.resetpinopti.UPDIErsatzReset.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}_1sec.hex
atxy2o.menu.resetpinopti.UPDIErsatzReset.bootloader.resetpinbits=01
atxy2o.menu.resetpinopti.reset=Reset (DANGER - Read docs first!)
atxy2o.menu.resetpinopti.reset.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}_rst.hex
atxy2o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy2o.menu.resetpinopti.gpio=IO (DANGER - Read docs first! powercycle to enter bootloader)
atxy2o.menu.resetpinopti.gpio.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy2o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

atxy2o.menu.startuptimeopti.8=8ms
atxy2o.menu.startuptimeopti.0=0ms
atxy2o.menu.startuptimeopti.1=1ms
atxy2o.menu.startuptimeopti.2=2ms
atxy2o.menu.startuptimeopti.4=4ms
atxy2o.menu.startuptimeopti.16=16ms
atxy2o.menu.startuptimeopti.32=32ms
atxy2o.menu.startuptimeopti.64=64ms
atxy2o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy2o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy2o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy2o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy2o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy2o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy2o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy2o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

atxy2o.bootloader.WDTCFG=0x00
atxy2o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2o.bootloader.OSCCFG=0x01
atxy2o.bootloader.TCD0CFG=0x00
atxy2o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy2o.bootloader.APPEND=0x00
atxy2o.bootloader.BOOTEND=0x02
